<div align=center>
  
<h1> Проекты </h1>

</div>


### Проект 1: составление чек-листа для тестирования веб-формы

<b>Цель проекта: </b> составление чек-листа на основе собственных требований

> [__Ссылка на проект__](https://drive.google.com/file/d/1lT8CJBqHCxUupHlRvAFwHIVCtG3PSG__/view?usp=sharing)

<b>Выводы по проделанной работе: </b>
 - получил практику по работе с чек-листами

***

### Проект 2: функциональное тестирование веб-сайта

<b>Цель проекта: </b> составить чек-лист функционального тестирования, тест кейсы и баг репорты для тестирования веб-сайта

> [__Ссылка на проект__](https://rift-barracuda-b30.notion.site/1f144ad040058054b87efb6cbd4e4685)

<b>Выводы по проделанной работе: </b>
 - закрепил знания чек-листов на основе функциональных тестов
 - получил практику по составлению тест-кейсов и баг-репортов

***

### Проект 3: SQL запросы и Python
P.S. Тестовое задание взято из открытого источника


<b>Цель проекта: </b> проверка знаний составления SQL запросов и использования базовых функций Python

> [__Ссылка на тестовое задание__](https://docs.google.com/document/d/1ylGFf4_p4w9S8PvRsZF0UdyeokWol3KS/edit?tab=t.0)

> [__Ссылка на проект__](https://drive.google.com/file/d/1X7UsWOKoR80VPonCHGKsWaXz0uNLvLi_/view?usp=sharing)

<b>Выводы по проделанной работе: </b>
- Закрепил знания SQL запросов
- Получил практику использования Python

***

### Проект 4: API и Postman
P.S. Тестовое задание взято из открытого источника

<b>Цель проекта: </b> совершенствование знаний API, использование Postman

> [__Ссылка на тестовое задание__](https://imgur.com/a/gGnRVda)

> [__Ссылка на проект__](https://drive.google.com/file/d/1wQvJxF4CXRELKEe3eJHZ0mnhk-orrkXr/view?usp=sharing)

Также коллекция запросов Postman хранится в закрепленных файлах репозитория

<b>Выводы  по проделанной работе: </b>
- Закрепил знания и практические навыки использование Postman для тестирования API

***

### Проект 5: тестирование интернет магазина [OPENCART.COM](https://demo.opencart.com/)

В данный момент работаю с тестированием этого сайта, информация будет дополняться

> [__Ссылка на проект__](https://www.notion.so/1fb44ad04005801a98fbf188a1061551?pvs=4)
